       IDENTIFICATION DIVISION.
       PROGRAM-ID. anothersubsample.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 SOMEVAR PIC X ANY LENGTH.
       PROCEDURE DIVISION USING SOMEVAR.
           DISPLAY SOMEVAR.
       END PROGRAM anothersubsample.

