       IDENTIFICATION DIVISION.
       PROGRAM-ID. helloargs.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARGV PIC X(10) VALUE SPACES.
       01 ARGC PIC 9(1) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT ARGV FROM ARGUMENT-VALUE.
           ACCEPT ARGC FROM ARGUMENT-NUMBER.
           DISPLAY "Arguments: ", ARGC.
           PERFORM UNTIL ARGV = SPACES
               DISPLAY ARGV
               MOVE SPACES TO ARGV
               ACCEPT ARGV FROM ARGUMENT-VALUE
           END-PERFORM.
           STOP RUN.
