       IDENTIFICATION DIVISION.
       PROGRAM-ID. subsubsample.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 WS-GROUP.
             05 WS-GROUP-NUMERIC PIC 9(2).
             05 WS-GROUP-SIGNED-DECIMAL PIC S9(3)V9(2).
             05 WS-GROUP-UNSIGNED-DECIMAL PIC 9(3)V9(2).
             05 WS-GROUP-ALPHABETIC PIC A(6).
             05 WS-GROUP-ALPHANUMERIC PIC X(5).
       PROCEDURE DIVISION USING WS-GROUP.
           DISPLAY WS-GROUP-ALPHANUMERIC.
       END PROGRAM subsubsample.

